app/views/vikings/_form.html.erb

    <%= form.label "Diet" %>
  	<%= form.select :diet_id, Diet.all.map{|diet| [diet.diet_type, diet.id]} , {}, class:"form-control" %>
---
SELECT "diets".* FROM "diets"