app/views/vikings/edit.html.erb

SELECT "diets".* FROM "diets"
---
	<%= form.label "Diet" %>
	<%= form.select :diet_id, Diet.all.map { |diet| [diet.diet_type, diet.id]} %>