app/views/vikings/new.html.erb

	<%= form.label "Diet" %>
	<%= form.select :diet_id, Diet.all.map { |diet| [diet.diet_type, diet.id]} %>
---
SELECT "diets".* FROM "diets"