app/views/vikings/show.html.erb

  </tr>
  <% @viking.my_viking_exercises.each do |viking_exercise| %>
---
SELECT "viking_exercises".* FROM "viking_exercises"