app/controllers/application_controller.rb

	def define_logged_in_viking

		if(session[:signed_in_viking_id])
			@logged_in_viking = Viking.find(session[:signed_in_viking_id])
---
SELECT  "vikings".* FROM "vikings" WHERE "vikings"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]