app/controllers/diets_controller.rb

	def index
		@diets = Diet.all
---
SELECT "diets".* FROM "diets"

	def show
		@diet = Diet.find(params[:id])
---
SELECT  "diets".* FROM "diets" WHERE "diets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]