app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
---
  def index
    @exercises = Exercise.all

INSERT INTO "exercises" ("name", "exercise_type", "time", "calories", "instruction_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "viking_exercises" ("viking_id", "exercise_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["viking_id", 13], ["exercise_id", 4], ["created_at", "2018-08-23 22:26:07.400368"], ["updated_at", "2018-08-23 22:26:07.400368"]]
---
  def create
    @exercise = Exercise.new(exercise_params)
    if @exercise.valid?
      @exercise.save
      VikingExercise.create(viking_id:session[:signed_in_viking_id], exercise:@exercise)

UPDATE "exercises" SET "calories" = ?, "instruction_link" = ?, "updated_at" = ? WHERE "exercises"."id" = ?  [["calories", 1.0], ["instruction_link", "hello_world"], ["updated_at", "2018-08-21 20:28:11.593619"], ["id", 3]]
---
  def update
    if @exercise.update(exercise_params)

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def current_exercise
    @exercise = Exercise.find(params[:id])