app/controllers/sessions_controller.rb

SELECT  "vikings".* FROM "vikings" WHERE "vikings"."name" = ? LIMIT ?  [["name", "Sean Huang"], ["LIMIT", 1]]
---
	def create
		viking = Viking.find_by(name: params[:name])