app/controllers/vikings_controller.rb

	def index
		@vikings = Viking.all
---
SELECT "vikings".* FROM "vikings"

	def update

		if @viking.update(viking_params)
---
UPDATE "vikings" SET "password_digest" = ?, "residence" = ?, "updated_at" = ? WHERE "vikings"."id" = ?  [["password_digest", "$2a$10$IhcDPNJ8hYyq6lA0hkTP/uWnOCvMnj162Wbef7bJEyZaoFH/TuuLG"], ["residence", "Tokyo, Japan"], ["updated_at", "2018-08-24 17:02:59.377061"], ["id", 12]]

	def current_viking
		@viking = Viking.find(params[:id])
---
SELECT  "vikings".* FROM "vikings" WHERE "vikings"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]