app/controllers/viking_exercises_controller.rb

  def create
    VikingExercise.create(viking_id:session[:signed_in_viking_id], exercise_id:session[:current_exercise_id])
---
INSERT INTO "viking_exercises" ("viking_id", "exercise_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["viking_id", 13], ["exercise_id", 2], ["created_at", "2018-08-22 20:34:17.254586"], ["updated_at", "2018-08-22 20:34:17.254586"]]

  def destroy
    viking_exercise = VikingExercise.find(params[:viking_exercise_id])
    viking_exercise.destroy
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "viking_exercises".* FROM "viking_exercises" WHERE "viking_exercises"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "viking_exercises" WHERE "viking_exercises"."id" = ?  [["id", 16]]