app/models/viking.rb

SELECT SUM("exercises"."calories") FROM "exercises" INNER JOIN "viking_exercises" ON "exercises"."id" = "viking_exercises"."exercise_id" WHERE "viking_exercises"."viking_id" = ?  [["viking_id", 12]]
---
	def total_calories
		self.exercises.sum(:calories)

SELECT SUM("exercises"."time") FROM "exercises" INNER JOIN "viking_exercises" ON "exercises"."id" = "viking_exercises"."exercise_id" WHERE "viking_exercises"."viking_id" = ?  [["viking_id", 12]]
---
	def total_time
		self.exercises.sum(:time)

SELECT "viking_exercises".* FROM "viking_exercises"
---
	def my_viking_exercises
		VikingExercise.all.select do |viking_exercise|