app/models/viking.rb

SELECT "viking_exercises".* FROM "viking_exercises"
---
	def my_viking_exercises
		VikingExercise.all.select do |viking_exercise|